      * BJACK-DECK -- CARD MANAGEMENT ROUTINE
      * WRITTEN 01/12/84 -- UPDATED 06/88 FOR NEW DECK SIZE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BJACK-DECK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY WS-DECK.
           77 WS-X1          PIC 9.
       PROCEDURE DIVISION.
       INIT-1.
           MOVE 0 TO WS-X1
           GO TO PROC-A.
       PROC-A.
           STOP RUN.
