      * BJACK-DEALER -- DEALER TURN AUTOMATION
      * WRITTEN 05/84 -- UPDATED 08/89 FOR SOFT 17 RULE CHANGE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BJACK-DEALER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY WS-HANDS.
           COPY WS-GAME.
           05 WS-X1          PIC 9.
       PROCEDURE DIVISION.
       INIT-1.
           MOVE 0 TO WS-X1
           GO TO PROC-A.
       PROC-A.
           STOP RUN.
