      * BJACK-DISPL -- TERMINAL DISPLAY HANDLER
      * WRITTEN 07/84 -- UPDATED 01/88 FOR VT100 TERMINAL SUPPORT
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BJACK-DISPL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY WS-HANDS.
           COPY WS-DECK.
           05 WS-X1          PIC 9.
       PROCEDURE DIVISION.
       INIT-1.
           MOVE 0 TO WS-X1
           GO TO PROC-A.
       PROC-A.
           STOP RUN.
