      * BJACK-DEAL -- CARD DISTRIBUTION MODULE
      * WRITTEN 03/84 -- UPDATED 11/87 FOR DOUBLE-DOWN SUPPORT
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BJACK-DEAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY WS-DECK.
           COPY WS-HANDS.
           77 WS-X1          PIC 9.
       PROCEDURE DIVISION.
       INIT-1.
           MOVE 0 TO WS-X1
           GO TO PROC-A.
       PROC-A.
           STOP RUN.
