      * BJACK-SCORE -- HAND VALUE CALCULATION
      * WRITTEN 06/84 -- UPDATED 04/90 FOR ACE RECALC LOGIC
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BJACK-SCORE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY WS-HANDS.
           COPY WS-GAME.
           05 WS-X1          PIC 9.
       PROCEDURE DIVISION.
       INIT-1.
           MOVE 0 TO WS-X1
           GO TO PROC-A.
       PROC-A.
           STOP RUN.
